import type { Timezone } from './components/timezone-select-modal'

export const PERSONAL_GROUP_NAME = 'Личная'

export const TIMEZONES: Array<Timezone> = [
  { label: 'Бейкер и Хауленд (острова, США) −12:00', value: -720 },

  { label: 'Американское Самоа, Паго-Паго −11:00', value: -660 },

  { label: 'Гавайи (США), Гонолулу −10:00', value: -600 },

  { label: 'Маркизские острова (Французская Полинезия) −09:30', value: -570 },

  { label: 'Аляска (США), Анкоридж −09:00', value: -540 },

  { label: 'Лос-Анджелес, Сиэтл, Ванкувер −08:00', value: -480 },

  { label: 'Денвер, Калгари, Эдмонтон −07:00', value: -420 },

  { label: 'Чикаго, Мехико, Сан-Хосе (Коста-Рика) −06:00', value: -360 },

  { label: 'Нью-Йорк, Торонто, Лима, Богота −05:00', value: -300 },

  { label: 'Сантьяго (Чили), Каракас, Ла-Пас −04:00', value: -240 },

  { label: 'Сент-Джонс (Ньюфаундленд, Канада) −03:30', value: -210 },

  { label: 'Буэнос-Айрес, Бразилиа, Монтевидео −03:00', value: -180 },

  { label: 'Фернанду-ди-Норонья (Бразилия) −02:00', value: -120 },

  { label: 'Кабо-Верде, Прая −01:00', value: -60 },
  { label: 'Лондон, Дублин, Лиссабон ±00:00', value: 0 },

  { label: 'Париж, Берлин, Рим, Мадрид +01:00', value: 60 },

  { label: 'Калининград +02:00', value: 120 },

  { label: 'Москва, Санкт-Петербург +03:00', value: 180 },

  { label: 'Тегеран (Иран) +03:30', value: 210 },

  { label: 'Самара +04:00', value: 240 },

  { label: 'Кабул (Афганистан) +04:30', value: 270 },

  { label: 'Екатеринбург +05:00', value: 300 },

  { label: 'Нью-Дели, Мумбаи, Коломбо +05:30', value: 330 },

  { label: 'Катманду (Непал) +05:45', value: 345 },

  { label: 'Омск +06:00', value: 360 },

  { label: 'Янгон (Мьянма), Кокосовые острова +06:30', value: 390 },

  { label: 'Новосибирск +07:00', value: 420 },

  { label: 'Иркутск +08:00', value: 480 },

  { label: 'Юкла (Австралия, неофициально) +08:45', value: 525 },

  { label: 'Якутск +09:00', value: 540 },

  { label: 'Аделаида, Дарвин (Австралия) +09:30', value: 570 },

  { label: 'Владивосток +10:00', value: 600 },

  { label: 'Лорд-Хау (Австралия) +10:30', value: 630 },

  { label: 'Магадан +11:00', value: 660 },

  { label: 'Камчатка, Петропавловск-Камчатский +12:00', value: 720 },

  { label: 'Самоа, Апиа +13:00', value: 780 },

  { label: 'Кирибати, Тарава (Лайн, о-ва) +14:00', value: 840 },
]

export const ADMIN_ROLE_ID = 1
export const SUPERVISOR_ROLE_ID = 2
export const MEMBER_ROLE_ID = 3
