TIMEZONES = {
    # UTC-12:00
    -720: "Бейкер и Хауленд (острова, США) −12:00",
    # UTC-11:00
    -660: "Американское Самоа, Паго-Паго −11:00",
    # UTC-10:00
    -600: "Гавайи (США), Гонолулу −10:00",
    # UTC-09:30
    -570: "Маркизские острова (Французская Полинезия) −09:30",
    # UTC-09:00
    -540: "Аляска (США), Анкоридж −09:00",
    # UTC-08:00
    -480: "Лос-Анджелес, Сиэтл, Ванкувер −08:00",
    # UTC-07:00
    -420: "Денвер, Калгари, Эдмонтон −07:00",
    # UTC-06:00
    -360: "Чикаго, Мехико, Сан-Хосе (Коста-Рика) −06:00",
    # UTC-05:00
    -300: "Нью-Йорк, Торонто, Лима, Богота −05:00",
    # UTC-04:00
    -240: "Сантьяго (Чили), Каракас, Ла-Пас −04:00",
    # UTC-03:30
    -210: "Сент-Джонс (Ньюфаундленд, Канада) −03:30",
    # UTC-03:00
    -180: "Буэнос-Айрес, Бразилиа, Монтевидео −03:00",
    # UTC-02:00
    -120: "Фернанду-ди-Норонья (Бразилия) −02:00",
    # UTC-01:00
    -60: "Кабо-Верде, Прая −01:00",
    # UTC±00:00
    0: "Лондон, Дублин, Лиссабон ±00:00",
    # UTC+01:00
    60: "Париж, Берлин, Рим, Мадрид +01:00",
    # UTC+02:00
    120: "Калининград +02:00",
    # UTC+03:00
    180: "Москва, Санкт-Петербург +03:00",
    # UTC+03:30
    210: "Тегеран (Иран) +03:30",
    # UTC+04:00
    240: "Самара +04:00",
    # UTC+04:30
    270: "Кабул (Афганистан) +04:30",
    # UTC+05:00
    300: "Екатеринбург +05:00",
    # UTC+05:30
    330: "Нью-Дели, Мумбаи, Коломбо +05:30",
    # UTC+05:45
    345: "Катманду (Непал) +05:45",
    # UTC+06:00
    360: "Омск +06:00",
    # UTC+06:30
    390: "Янгон (Мьянма), Кокосовые острова +06:30",
    # UTC+07:00
    420: "Новосибирск +07:00",
    # UTC+08:00
    480: "Иркутск +08:00",
    # UTC+08:45
    525: "Юкла (Австралия, неофициально) +08:45",
    # UTC+09:00
    540: "Якутск +09:00",
    # UTC+09:30
    570: "Аделаида, Дарвин (Австралия) +09:30",
    # UTC+10:00
    600: "Владивосток +10:00",
    # UTC+10:30
    630: "Лорд-Хау (Австралия) +10:30",
    # UTC+11:00
    660: "Магадан +11:00",
    # UTC+12:00
    720: "Камчатка, Петропавловск-Камчатский +12:00",
    # UTC+13:00
    780: "Самоа, Апиа +13:00",
    # UTC+14:00
    840: "Кирибати, Тарава (Лайн, о-ва) +14:00",
}
